<?php
require "zawgyi2unicode.php";
echo "<div style='line-height:30px'>";
echo zg_uni("ဒီစာကို ဖတ္လို႔ရေနၿပီဆိုရင္ ကၽြန္ေတာ္တို႔မွာ ယူနီကုတ္ေဖာင့္ ရွိေနပါၿပီ။ ေဖာင့္ကို ေသခ်ာျမင္ရၿပီးတဲ့ေနာက္ ယူနီကုတ္စနစ္ကို စ ရိုက္သုံးၾကည့္ၾကပါစို႔။ ေဇာ္ဂ်ီစာရိုက္စနစ္နဲ႔ အကၽြမ္းဝင္ေနသူေတြအဖို႔ လက္ကြက္မတူဘူးဆိုတဲ့ အေၾကာင္းျပခ်က္နဲ႔ ယူနီကုတ္ကီးဘုတ္ေဆာ့ဝဲေတြကို ႐ုတ္တရက္သုံးဖို႔ လက္တြန္႔ေနတတ္ၾကပါတယ္။ ဒါမ်ိဳးက လက္ကြက္႐ုတ္တရက္ေျပာင္းသုံးရင္ ျဖစ္တတ္တာ အမွန္ပါပဲ။ စာလုံးတစ္လုံးႏွစ္လုံးေလာက္လက္ကြက္မွာ ေျပာင္းသြားဟာ စာရိုက္သူရဲ့ အျမန္ႏွုန္းကို သိသိသာသာ ေႏွးေကြးသြားေစတတ္ပါတယ္။ ဒီျပႆနာကို ေျဖရွင္းဖို႔ IT ပညာရွင္တစ္ဦးျဖစ္သူ ကိုရာဗီက စည္းမ်ဥ္းေပါင္းတစ္သိန္းေက်ာ္ ပါဝင္တဲ့ Keyboard File ကို ေရးသားခဲ့ပါတယ္။ အဲဒီကီးဘုတ္ဖိုင္ကို အိႏၵိယက New Horizon Media ဆိုတဲ့ ကုမၸဏီက အခမဲ့ ျဖန္႔ေဝတဲ့ NHM Writer ကီးဘုတ္ေဆာ့ဝဲနဲ႔ တြဲဖက္အသုံးျပဳရပါတယ္။ အဲဒီကီးဘုတ္ေဆာ့ဝဲကို အင္စေတာလုပ္စရာဘလိုဘဲ အလြယ္စမ္းသပ္လို႔ရေအာင္ အိတ္ေဆာင္ဗားရွင္းလုပ္ထားတာ ရွိပါတယ္။");
echo "</div>";
?>