<?php
require "zawgyi2unicode.php";
echo zg_uni("သကၠရာဇ္ဆိုသည္မွာ အခ်ိန္ကာလကို အမွတ္အသား တစ္ခုအေနျဖင့္ သတ္မွတ္ထားေသာ စံတစ္ခုျဖစ္ေပသည္။ အခ်ိန္(၂၄)နာရီကို တစ္ရက္အျဖစ္ သတ္မွတ္ၿပီး ရက္ေပါင္း (၃၆၅)ရက္ကို တစ္ႏွစ္ဟု သတ္မွတ္သည္။ တစ္ႏွစ္ကို သကၠရာဇ္တစ္ဟု သတ္မွတ္ၾကသည္။ ကမၻာမွာ သကၠရာဇ္မ်ားကို ေလ့လာလ်င္ သကၠရာဇ္ ငါးမ်ိဳး ရွိေၾကာင္း ေတြ႕ရပါသည္။
မဟာသကၠရာဇ္ = ေဂါတမဘုရားရွင္၏ ဘိုးေတာ္ (သီရိမဟာ မာယာေဒဝီ၏ ခမည္းေတာ္) ေဒဝဒဟ ျပည့္ရွင္ဘုရင္ အဥၥနမင္းႀကီးသည္ ဒိဗၺစကၡဳအဘိညာဥ္ရ ေဒဝီလရေသ့ႏွင့္ တိုင္ပင္ၿပီး မိမိလက္ထက္၌ ေရာက္ဆဲျဖစ္ေသာ သကၠရာဇ္ (၈၆၄၅)ခုကို ထိုႏွစ္ တေပါင္းလကြယ္ စေနေန႔ အထိ ၿဖိဳၿပီးလၽွင္ တန္ခူးလဆန္း(၁)ရက္ တနဂၤေႏြေန႔ကို အစျပဳ၍ သကၠရာဇ္တစ္ခု ထားေလသည္။ ထိုသကၠရာဇ္ကို မဟာသကၠရာဇ္ဟု ေခၚတြင္ေလသည္။ ထိုအခ်ိန္သည္ ျမတ္စြာဘုရား ဖြားေတာ္မမူမီ (၆၈)ႏွစ္ အလိုျဖစ္သည္။ ေဂါတမဘုရားရွင္၏ သက္ေတာ္ (၈၀)ႏွင့္ေပါင္းေသာ မဟာသကၠရာဇ္၏ သက္တမ္းမွာ (၁၄၈)ႏွစ္သာ ရွိသည္။ ထို ၁၄၈-ႏွစ္ကို ၿဖိဳၿပီး သာသနာသကၠရာဇ္ကို စ၍တြက္သည္။
သာသနာသကၠရာဇ္ = မဟာသကၠရာဇ္၏ သက္တမ္းမွာ (၁၄၈)ႏွစ္သို႔ ေရာက္ေသာအခါ ေဂါတမဘုရားရွင္သည္ ပရိနိဗၺာန္ စံေတာ္မူသည္။ သာသနာေတာ္ အႏွစ္ (၅၀၀၀)ကိုလည္း ထားေတာ္မူခဲ့သည္။ ပရိနိဗၺာန္ စံေတာ္မူၿပီး ေလးလအၾကာ ရာဇၿဂိဳဟ္ျပည့္ရွင္ဘုရင္ အဇာတသတ္မင္း ႀကီးၾကပ္၍ ပထမသဂၤါယနာ တင္ေတာ္မူၿပီးေနာက္ သကၠရာဇ္ (၁၄၈)ကို ၿဖိဳခြင္းၿပီး သာသနာႏွစ္ သကၠရာဇ္(၁)ခု ႂကြင္းထားခဲ့သည္။ ထိုမွစ၍ သာသနာသကၠရာဇ္ ေပၚေပါက္လာသည္။
ေကာဇာ (ေဂါဇာ)သကၠရာဇ္၊ ျမန္မာသကၠရာဇ္ = သေရေခတၱရာမင္းဆက္ သုမုႏၵရီမင္း လက္ထက္မွ စ၍ ေရတြက္သည္။ (လက္ရွိ ျမန္မာ ျပကၡဒိန္)
ခရစ္သကၠရာဇ္ (ဘီစီ) = ခရစ္ေတာ္ မေပၚမီကာလ ေနာက္ကို ေရတြက္ရေသာ ႏွစ္မ်ားျဖစ္သည္။
ခရစ္သကၠရာဇ္ (ေအဒီ) = ခရစ္ေတာ္ ေပၚၿပီးႏွစ္မွစ၍ အစဥ္အတိုင္း ေရတြက္ရေသာ ႏွစ္မ်ားျဖစ္သည္။ (လက္ရွိ အဂၤလိပ္ ျပကၡဒိန္)");
?>